CG2/printProbe.tex
% Created 2018-01-18 Thu 09:29
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{XUEXI}
\date{\today}
\title{}
\hypersetup{
 pdfauthor={XUEXI},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 25.1.1 (Org mode 9.1.4)}, 
 pdflang={English}}
\begin{document}

\tableofcontents

\section{04\(_{\text{LineareFilter}}\)}
\label{sec:org1108b83}
\subsection{Filterung - Idee}
\label{sec:org8a8b605}
\begin{enumerate}
\item Filtermerkmale
\label{sec:org87c955d}
Ergebnis wird nicht aus einem einzigen Pixel brechnet, sondern aus einer Menge von Pixeln. Die Koordinaten der Quellpixel habe eine feste relative Position zum Zielpixel und bilden i.A. eine zusammenhängende Region. Parameter:
\begin{itemize}
\item Größe der Filterregion
\item Form der Filterregion
\item Gewichtung der Quellpixel(konstant oder ortsabhängig)
\end{itemize}
\end{enumerate}
\subsection{Lineare Filter}
\label{sec:org452f42c}
\begin{description}
\item[{Lineare Filter}] Wert des zielpixels wird als gewichtete Summe der Quellpixel berechnet
\end{description}
Größe und Form der Filterregion und Gewichte des Filter werden durch eine Matrix von Filterkoeffizienten spezifiziert, der Filtermatrix Hij oder Filtermaske.
Die Filtermatrix ist eine diskrete zweidimensionale Funtkion.
Koordinaten werden meist relativ zum Zentrum angegeben.
Im Gegensatz zu punktoperationen ist bei Filtern keine "in place"-Verarbeitung möglich, da die Quellpixel mehrere Male benötigt werden.

Zwei prinzipielle Varianten möglich: Ergebnis in ein Zwischenbild speichern, am Schluss komplettes Bild zurückschreiben. Alternativ:erst Kopie erstellen und Ergebnisse direkt ins Original-Bild schreiben.

\subsubsection{Implementierungsfragen}
\label{sec:orgba36126}
Oft ist es vorteilhafter, mit ganzzahligen Filterkoeffizienten zu arbeiten. Umwandlung und Speicherung des Bildes in Gleitkommaformat nicth sinnvoll. Realisierung über einen Skalierungsfaktor,nur eine double-Operation pro pixel. Filtergröße kann sehr leicht generisch implementiert werden, typisch: ungeradzahlige Größe, zentriert.
\subsubsection{Anwendung linearer Filter: Randbehandlung}
\label{sec:org334f3b1}
\begin{enumerate}
\item nur Zentralbereich auswerten, bei dem die Filtermaske ganz ins Bild passt, Outputbild wird kleiner.
\item Zero padding: Inputbild wird um 0 oder Grauwert erweitert, In-und Outputbild gleich groß. Schwarz oder Grau führt bei Mittelwertbildung zu Artefakten am Rand, insbesondere in hellen Region
\item Konstante Randbedingung: Die Pixel außerhalb nehmen den Wert des jeweils nächstliegenden Randpixels an. Wenig Artefakte, einfach zu implementieren, haüfig verwendet.
\item Gespiegelte Randbedingung:Die Pixelwerte werden an der nächstliegenden Bildkante gespiegelt.
\item Zyklische Randbehandlung: Die pixelwerte wiederholen sich zyklisch in allen Richtungen
\end{enumerate}
Fazit: Wahl der Rand-Methode abhängig vom verwendeten Filter. Debugging ob ein Filter korrekt arbeitet schwierig, da nicht notwendigerweise ein Programmabsturz vorliegen muss. Analyse der Funktionalität ein einfachen Muster-Beispielen notwendig
\subsection{Lineare Filter - Formale Eigenschaften}
\label{sec:org6490738}
\begin{description}
\item[{Ziel}] Effiziente Implementierung und Einsparen von Rechenoperationen
\end{description}
\subsubsection{Nutzen der Impulsfunktion}
\label{sec:org9ee435a}
Faltung mit der Impulsfunktion ergibt das ursprüngliche Bild.
Nützlicher:Die Impulsfunktion als Input eines linearen Filters liefert die Filterfunktion H als Ergebnis, d.h. ein unbekannter lin. Filter lässt sich durch Anwendung auf ein Bild mit einem weissen und sonst nur schwarzen Pixeln entschlüsseln. Es steht dann die Filtermatrix im Ergebnis-Bild.
\subsubsection{Lineare Filter - Grenzen}
\label{sec:orgf9faa3a}
Lineare Glättngsfilter reduzieren zwar Rauschen im Bild, aber gleichzeitig werden Kanten oder Linien verbreitert und im Kontrast reduziert. Lineare Filter bilden immer auf irgend eine Art und Weise Mittelwerte, daher ist die Funktionalität letztlich begrenzt.
\subsection{Nicht-Lineare Filter}
\label{sec:org071d02f}
Nichtlieare Filter werden so wie lineare Filter über eine Umgebung R des Zielpixels mit einer nichtlinearen Funktion berechnet, z.B Minimum- und Maximumfilter
\subsubsection{Minimum- und Maximumfilter auf Salt-Pepper-Rauschen}
\label{sec:org29dbad5}
Minimumfilter eliminiert weiße Punkte und verbreitert dunkle Regionen.
Maximumfilter macht das Gegenteil.
\subsubsection{Median-Filter}
\label{sec:org9b741a7}
Der Median-Filter ersetzt jeden Pixel durch den Median seiner Umgebung R
\begin{enumerate}
\item Vergleich Linearer Glättungsfilter vs. Medianfilter
\label{sec:orgb05d554}
Der lineare Filter dämpft das Rauschen, macht aber das Bild unscharf. Der Medianfilter eliminiert Spitzen/Höhen, erzeugt örtlich Flecken mit konstanter Intensität. Erweiterung:gewichteter Median-Filter.

Grundidee:Wert wird in der sortierten Liste so oft wiederholt, wie sein Gewicht ist. Diese Länge ist die Summe von alle Element in Gewichtmatrix.
\end{enumerate}
\end{document}